# Задание 1: Вывод текста на экран
# Напишите код, который выводит на экран следующее:
# I will be a Python developer!

print('I will be a Python developer')
