# Задание 18: Атрибуты
# Создайте класс BlogPost с атрибутами user_name, text, number_of_likes.
# Создайте два объекта этого класса.
# После создания измените атрибут number_of_likes одного из объектов.
# Распечатайте атрибут number_of_likes каждого из объектов

# class BlogPost:
#     def __init__(self, user_name, text, number_of_likes):
#         self.user_name = user_name
#         self.text = text
#         self.number_of_likes = number_of_likes
#
#
# first_user = BlogPost(user_name='Igor', text='Hi', number_of_likes=10)
# second_user = BlogPost(user_name='Ivan', text='Hello', number_of_likes=15)
# first_user.number_of_likes = 20
# print(first_user.number_of_likes, second_user.number_of_likes)
