# Задание 2: Вычисление арифметических выражений
# Выведите на экран результат произведения чисел 3 и 7
# Выведите на экран результат возведения числа 4 в степень 3
# Выведите на экран результат вычисления остатка от деления числа 29 на 5

print(3 * 7)
print(4 ** 3)
print(29 % 5)
