# Задание 22: Встроенные модули
# Импортируйте встроенный модуль math. Вычислите при помощи функций этого модуля:
# 1. Корень квадратный из числа 123456789
# 2. Факториал числа 987
# 3. 876 в степени 54

import math

print(math.sqrt(123456789))
print(math.factorial(987))
print(math.pow(876, 54))
