# Задание 3: Создание переменных
# Создайте переменные, описывающие автомобиль - модель, цвет, год, количество дверей.
# Поместите в них значения.
# Затем поменяйте цвет автомобиля, присвоив ниже в коде новое значение соответствующей переменной.
# Выведите на экран все значения.
# При создании имён переменных используйте подходящие по смыслу слова.
# Воспользуйтесь Google переводчиком, если нужно.

model = 'BMW'
color = 'acid green'
year = 2020
doors_amount = 5
color = 'black'
print(model, color, year, doors_amount)

# Создайте переменные, в которые будете помещать возраст людей.
# Также создайте переменную, в которой будет храниться количество людей.
# Вычислите и выведите на экран средний возраст человека исходя из данных о возрасте этих пятерых людей.
# Если не знаете формулу вычисления среднего арифметического значения, воспользуйтесь поиском информации в интернете.
# При создании имён переменных используйте подходящие по смыслу слова.
# Воспользуйтесь Google переводчиком, если нужно.

age1 = 13
age2 = 21
age3 = 35
age4 = 47
age5 = 69
people = 5
print((age1+age2+age3+age4+age5)/people)
