# Задание 8: Lists
# Создайте список, содержащий разные типы данных

my_list = ['a', 2, 1.8]
print(my_list)

# Создайте список, вырежьте из него элементы с 1 по 3,
# поместите их в новый список и распечатайте

my_list = ['a', 2, 1.8, 'b', 5]
new_my_list = my_list[:3]
print(new_my_list)
