# Задание 9: Dictionaries
# Создайте объект dictionary,
# содержащий пары ключей и значений,
# выведите на экран одно значение

my_dictionary = {'first': 1, 'second': 2, 'third': 3}
print(my_dictionary['first'])

# Создайте объект dictionary, описывающий компьютер

my_computer = {'Computer model': 'Macbook Pro 13\'',
               'Release date': '2019',
               'CPU': '1,4 GHz Intel Core i5',
               'RAM': 'ГБ 2133 MHz LPDDR3',
               'Graphics': 'Intel Iris Plus Graphics 645 1536 МБ',
               'Realease cost': '1736$',
               'Nowadays cost': '1361$'
               }
print(my_computer)
